import { TChapters } from "@customtypes/chaptersType";
import { TLoading } from "@customtypes/loadingType";
import { createSlice } from "@reduxjs/toolkit";
import actGetChapters from "./act/actGetChapters";
import { isString } from "@customtypes/isString";
import actAddChapter from "./act/actAddChapter";
import actAcceptChapters from "./act/actAcceptChapter";
import actDenyChapters from "./act/actDenyChapter";

// const initialState = [{
//     id: 23,
//     title: '"رجلٌ مَنسي"',
//     content: `
// - منذ ذلك العهد، كنتُ أعرف بأني تغيرت، أو على الأقل سأتغير، فقد شحُب وجهي، وكانت معدتي تتسول الطعام، وكان جسدي يفتقر الراحة، كنت أنام، والدموع تبلل خداي، لا أعرف طعماً للاسترخاء، وأحبتي تدفنُ ها هنا في قبري أنا، وتترك جسدي بلا كفنٍ يستريح به، تتركني لأواجه الحياة بمفردي، كانت الحرب أقسى من أن نحتمل، مشاهد قاذفات الطاقة، والقنابل الكهرومغناطيسية، والصواعق النووية، إنّ الواحد منا حين يتصور أنها قد تنزل وتستقر على أحد بيوتنا، على أسقف غرفنا، يموت حياً من الرعب، في ليلةٍ واحدةٍ سقطت روحي في الظلمات، لتختارها فيما بعد كي تعبر جسر الحياة، وها أنا أمامكم أيُّها السادة بجسدٍ هرم واجه الكثير ولكنه مستمر كما الحياة، واليوم وقد غادرنا واحدٌ من مجلس شيوخنا الكرماء السيد المستشار كاندوس إلياستر، ورغم أسانا وألمنا على فراقه، يجب أن نستمر، من أجله، و نسير على نهجه، نحو غدٍ أفضل، وتطورٍ أرقى، وعالمٍ مسالم.

// كان صوته الرخيم الشجّي، كفيل لجعل أوصال كل من في القاعة، ترتجف ألماً وشوقاً، ومظهره المهيب، يترك رهبةً على جميع مستمعيه .
// كانت عباءته المزركشة الطويلة، تجعل فانتو يحدق بطريقة عجيبة، فمظهره لا يوحي فقط بالغرابة وإنما أن هذا الرجل أتى من بلاد ما بعيدة وكأنه من عالمٍ آخر، شعره طويلٌ أبيض كما ذقنه ، وعينه المصابة يزينها خدشٌ أو جرحٌ، يبدأ طريقه من فوق الحاجب  الأيسر وحتى منتصف الخد، وأكثر مايثير الرعب هو بياضها المفقود، كانت كليلةٍ مقمرةٍ يزينها نجمٌ في السماء السوداء، هدوءه البارز على تفاصيل وجهه، وتحركات يديه، وحتى لغته وكلماته، كل ذلك يفتن حضوره، لا عجب أن يحصل أخنيتال لابستر على كل هذه الشعبية في مدينة إغنورا، يقال أنّه من الرجال القلة الذين خوِّل لهم، السفر خارج المدينة، رفقة سفراء ومستشارين، إذاً هو من قلة الناس الذين استطاعوا رؤية العالم، والتواصل مع بقيته، كان رأس فانتو ذو السابعة عشر ربيعاً لا يكف عن التفكير حول أمر هذا الرجل الغريب، تأمّل خاتم بنصره الأيسر، كان حجرٌ أحمر اللون يتوسطه، يتلألأ، شعر بأنه يلتمع بطريقةٍ غير طبيعية.
// - لا .. لا أنا متأكد أن هذا الإنسان غير عادي!

// مجموعة رجال ٍ حملوا التابوت بأذرعهم وساعدوا بإنزاله إلى مرقده الأخير، أشاح الجميع عن ذلك المشهد بينما ظلّ أخنيتال يحدق به، عاد صوته الرخيم يملأ المكان الواسع، مقبرة آل إلياستر كبيرة وواسعة فبحكم أنهم كانوا ينحدرون من طبقة النبلاء لابُّد أن يتم الاعتناء بكل شيء، إلى أن غدت المقبرة كحديقة حقيقية يمكن زيارتها بعيداً عن كونها مقبرة.

// كان أخنيتال لا يتوقف عن العزف على وترٍ حساس، يهز به أركان الإنسان، كما يفعل عادةً في العزاءات، يشاركهم تجربة الموت ويحدثهم عن الروح وأين تذهب، ولا يتوقف عن ذكر حقيقة البشر..
// - نعم، إنه الموت يا أعزائي، أقرب شخصٍ إلينا، واقفٌ دوماً بقربنا، ينتظر اللحظة الحاسمة، لطفلٍ مازال يلعب، لشاب ٍ يستمر بالسعي وراء أحلامه ، لفتاةٍ لم تتزوج بعد، لعجوزٍ وزوجته، يلتقون كلهم في خلاصة الحياة، في خط النهاية.
// ترقرقت دموع ٌ والبعض صار ينشج، رفع أخنيتال ذراعيه وراح يدعي .

// كرتين زرقاوين، قيدهما حاجبان كثّان، ونظرةٌ حادةٌ، ابتلعت الأرض، خطواتٍ بطيئة، متثاقلة، تحمل جسداً متعباً كما كل يوم، كان شعره الأسود المنسدل خلف أذنيه، يلتمع مع شعاع عينيه، ورغم أن كل شيء متناغمٌ في بحر اليأس الذي أغرق به نفسه إلا أن المشاهد الأخيرة، كانت هي الأعنف، والذي كبّلت عقله ونزعت قلبه، وانتشلته من الحياة ورمته ليتذوق الموت، راح يتجول مرهقاً بين أزقة نتنة، تحاول أيدٍ فيها القبض على جسده، تارةً من أجل بعض حبوبٍ من قاطعي الطرق، وتارةً ترياقٌ من محترفي الهذيان، وتارةً أخرى، ذراعا فتاةٍ، ارتسم الليل بين رغباتها علّها تحصل بها بعض العملات، وكل ذلك لن يحرك شيئاً في نفس  أرسلان، فهو كبر في الظلام و اعتاد عليه، على آثامه، في تلك المدينة، التي لا تعرف بها سوى تجارة الآثام بأنواعها، مدينة دايجورا المظلمة.

// فتح باب بيته الصدئ، في ذلك الشارع الرطب، الممتلئ بدخانٍ أسود كثيف، كان طبقه قد تعفن من وجبته الأخيرة، تأمل ثيابه الرثة البالية، لقد أصبح مهملاً لنفسه هذه الفترة، ارتمى على فراشه، ولكن كيف يواجه الحقيقة.
// اغلق عينيه ووضع ذراعيه فوق جبينه يتذكر ماجرى في الساعات الأخيرة...
// - أنت أحمق أحمق كبير!!
// - لا تقل ذلك يا صديقي
// ضرب الطاولة بيديه
// - صديقك؟! أنتَ لم تعد صديقي
// - انتظر يا أرسلان لا تتسرع بالحكم على المنجل، أترى وشم يدي؟
// ظهر وشم منجلٍ يتوسط أسفل ذراعه وفوق كفه اليمنى، استطرد قائلاً
// - هذا نحن، الفلاحون، العاملون، الشحادون، تجار الليل .. نحن من سينبثق من الظلام ونقضي على النور ونصنع غداً جديداً لنا إغنورا لنا وليست لايتنرا من تقرر ذلك!
// - أنت مجرد أحمق كبير يا كامان، تقتلون الأبرياء ثمّ تدعون أنكم ثوار، إن ثورتكم كلها باطلة وكفى، اغرب عن وجهي، لن أراك مجدداً، يا صديق الطفولة، أنت مت ها هنا، ولم أعد أعترف بوجودك.
// انصدم كامان بكلام أرسلان الأخير ولم يتوقع رده ذاك.
// بعد ومضات الذكريات تلك، كزّ على أسنانه بقوة، واستسلمت زرقاوتيه، لعالم ٍ آخر أخذه النوم له، ربما رفقة كانتس أو أمه المقيمة في احلامه.

// بعد انتهاء مراسم الدفن، أقدام ٌ بخطى ثابتة تتقدم وتتبع، ذاك الرجل ذو العباءة المزركشة، كانت سيارةٌ تنتظره، ليركبها، ويعود إلى منزله، توقفت قدما فانتو وراح يبحث بجد عن سيارة أجرة، أسرعت السياراتان اللتان تعملان على القوة المغناطيسية المتدافعة، أن ترتفعا عن الأرض بضع سنتمترات وتطيران نحو وجهتهما حين نزل، أخنيتال، تبعه فانتو وهو يرتعش من فرط الأدرينالين، كانت المدينة مظلمة بحق، ذاك مازاد ارتعاشه الفعلي، لم يسبق له أن خرج من حدود مدينة لايتنرا من قبل، لا شك أن دايجورا مرعبة فظلامها القاتم ينهش أجواءها، هكذا راح يردد وقلبه يرتجف من بين أضلعه، ولكن حين وضعت تلك الأيدي الحازمة على كتفيه، حتى صرخ من خوفه، وانكمش مبتعداً، لاح وجهه في الظلام، مثل شيطانٍ أثيم.
// - مالذي تريده؟!
// - لا .. لا أريد شيء
// - اذاً لماذا تتبعني؟
// - لا... لا شيء لقد تهت فقط
// - إذاً عد أدراجك أيها الوغد وإلّا خطوةٌ واحدةٌ في هذا العالم الموحل، وستموت مبللاً سروالك هل تفهم!!
// أومأ بذعرٍ وجهه وعاد إلى السيارة المنتظرة.

// اتصل بها عند المساء كعادته عند انتهاء الاعمال والاجتماعات، الا أن الشيء الوحيد الذي يتغير يوماً بعد يوم هو لهجته الموبخة القاسية.
// - هل رأيتها على التلفاز، هل فعلتِ؟ هل تعلمين كيف بدأت لقد احتلت عناوين الجرائد والصحف بمقالاتها، ورؤيتها الثاقبة وكأنها تنظر من زاوية مختلفة لا نراها، لقد اجادت التفكير هل تعلمين كيف؟ لقد درست وتعلمت، رغم أنها يتيمةُ الأب، لقد تركها صديقي وعهدها للنجاح، وكل ذلك بدأته بعمر السادسة عشر، فما أنتِ فاعلة يا كاميليانا؟ يا فتاة الثامنة عشر؟ فلينفعك ما تهتمين له، فلتغرقي نفسك بالحفلات ولتشبعي من صديقاتك، ولكن الفشل ستبقي متعطشة له أنا أثق بذلك هل فهمت!
// ثم أغلق الهاتف في وجهها بعنف، فانسلت دموعها كالجمرة تحرق وجنتيها، لم تكن جديدةً على توبيخ أبيها لها، ولكنها تعبت منه ومن مقارنته تلك، يودها أن تتصدر المشهد، وتأخذ الشهرة، وتنال أعلى معدل، وتدخل أفضل جامعة، وتتزوج شابّ استثنائي من أنبل عائلات المدينة.
// كان ذلك كثيرٌ عليها، حملٌ كبيرٌ يقسم أحلامها لنصفين!
// قطع صوت أفكارها وجهٌ أبيضٌ بعينين حازمتين، يزين الشاشات المنتشرة في المدينة، مع صوتٍ رنانٍ يزيد النهار بهجة، راحت ترد على مستضيفها بكل رقي، وتنقد فكرته ببراعة، ثم تنظر في عيني مشاهديها.
// - أجل لا سلام دون أن نحارب، المستقبل لمدينتنا، يبدأ بأن نحارب للتطور وللرقي، عندها تكون لغة السلام ممكنة!
// صفق الجمهور وانتهت الحلقة، لتعود الشاشات مملةً مكتظة بالاعلانات، أغلقت الشاشة بعنف، وطمرت رأسها بوسادتها، ثم رفعت رأسها كاميليانا وهتفت

// - إني على الأقل لن أسمح لك أن تأخذي رجلي مني كما سمحت بأن تتألقي وتأخذي الأضواء سترين!

// استيقظ أرسلان على صوت لوحه الرقمي يرن، كان اتصال فيديو، لم يكن هندامه مرتباً ولا شعره المشعث ولا المكان الذي مكث فيه أصلاً، اهتز قلبه حين رأى من المتصل، كان بروفيسور جامعته، جامعة إغنورا العليا، تذكر تشجيع كانتس له على إكماله الدراسات العليا لهندسة الطاقة، إلا أن تشجيعها ذاك الآن مع استمرار رنين المتصل، غدا مزعجاً لدرجة أنه كره كانتس الآن، ضحك من الفكرة، ثمّ توقف الرنين فألقى نظرة، فتلقى رسالة مفادها أنه مدعو لحفل عشاء أقامه البروفيسور أرنالدوس أوريند، الرجل الذي ساعده بفضل مخطوبته كانتس فهي لها مكانة عنده بحكم أنه صديق والدها السفير المتوفي.
// نهض أخيراً، وجهّز ملابس جديدة مرتبة، وأخذ حماماً وراح يسرح شعره، تحسس بيده وشماً يتوسط يسار صدره، كان عبارة عن دائرة بداخلها شقٌ أو خطٌ فاصلٌ بشكلٍ مائل، عُكف حاجبيه الكثيفين ألماً، وهو يتذكر كيف حصل على هذا الوشم، كان صغيراً آنذاك، يصرخ باكيا ً، وأمه تثبته من ذراعيه، ورجلٌ يعمل ُ على إضافة تلك العلامة المميزة، كعلامة احتقار لتمييز شعب دايجورا، كم تمنى أن تنقشع هذه الغُمة عن مدينته المظلمة، ذنب من فقط؟ إنّه ذنب الأغنياء شعب لايتنرا، الذين يتنعمون بالرخاء والطاقة والثروات ويدرسون ويعملون بأفضل المهن والوظائف، في حين يتركون فتات الخبز، واللقيمات الصغيرة، لشعب دايجورا، يرمونه في الظلمات بسبب انعدام الطاقة، فلا ضوء ولا شيء يشعلونه، كي يقيهم من برد العتمة الذي يجتاح الإنسان في العيش بها.
// تجول متألماً ينزف من أفكاره تلك التي تحمل الحقيقة المرة، فيشاهدها بمرأى عينيه، بين المتشردين والمتسولين، والفقراء الذين يمتهنون أحقر الأعمال، وصل للخط الفاصل بين المدينتين، وعاد للنور، إلى مدينة لايتنرا المشرقة المتطورة، لا يصدق بأن مدينة إغنورا شطرت لنصفين واحدٌ بتلك الظلمة، وآخر بذلك الضوء الساطع.

// كانت الحفلات الراقصة في مدينة لايتنرا لا تستهويه مطلقاً، كانت مجرد إحياءٍ لفلكلورٍ ميت لسكان وحكام هاته المدينة، لقد جاء فقط ليلبي دعوة بروفيسوره، وقد عرف بأن البروفيسور أرنالدوس أوريند، كان سفيراً سابقاً، والآن ظل يعمل كبروفيسور في أكاديمية إغنورا العليا، وهو المشرف على بحثه الذي سيقدمه نهاية السنة، أخيراً وبعد أن ملّ الانتظار تقدم رجل يضع نظارة دائرية صغيرة، ولديه لحية مبوزة، يرتدي قميصاً أيضاً وقلنسوة، كانت هيئته اللامعة كباقي سكان المدينة، ثريٌ يتفاخر بشخصيته ونفسه، انحنى أرسلان لتحيته، وسرعان ما بدأ البروفيسور بإغراقه بأبهى الكلمات، معلقاً على ثياب أرسلان الأنيقة، اذ كان يرتدي بذلة كحلية اللون تتماهى مع لون عينيه، مسرحاً شعره الطويل خلف أذنيه، ثم انتقل إلى اغراقه بكلمات الثناء حول أفكاره وعقله النير وإنجازاته، أحس أرسلان باحراج كبير ولم يتوقف عن ترديد كلمات على غرار، شكراً لك سيدي، هذا من كرمكم وحسن ظنكم بي، سأعمل على ألا أخيب آمالكم.
// وداخلياً أحس أرسلان أن البروفيسور في جعبته شيءٌ يود طرحه ما أن يختلي به بعيداً عن الحضور وبالفعل، أخذه على طرف في الطابق الثاني من القصر، وجعله يجلس امامه على طاولة فاخرة تحوي أرقى انواع المأكولات والمشروبات، ثم بدأ بالحديث عن الجامعة، والتدريس والأبحاث، حتى وصل إلى النقطة التي يتحرق لأن يوضحها له، أشار بيده نحو مجموعة فتيات يضحكن ويشربن بعض المرطبات، قائلا ً
// - أترى تلك الجميلة هناك، إنّها كاميليانا ابنتي البكر الوحيدة
// - تشرفت ياسيدي
// أومأ برأسه
// - إنها تعذبني، أودها أن تلتحق بالأكاديمية السنة القادمة بعد أن تنهي الثانوية ولكن علاماتها المخزية ستجلطني يوماً وتقف عائقاً في طريق رغبتي تلك.
// - أخبرني ياسيدي كيف أساعدك؟
// - أريد أن تخصص لها من وقتك، درسين او درساً في الأسبوع.
// - سيكون من دواعي سروري ولكن لماذا أنا بالتحديد؟ أقصد يمكنك أن تستعين بأحدٍ مختص بالتدريس.
// تنهد البروفيسور أرنالدوس
// - أنت لن تخيب أمالي، أليس كذلك يا أرسلان، فمنذ أن وقع اختياري عليك، وتوصيتي بك وبتعليمك أردتك ان تكون خير داعم لي، فهل تفعل؟
// وضع أرسلان يده بانفعال واضح على صدره وانحنى
// - بالطبع ياسيدي، سأكون رهن إشارتك
// أومأ البروفيسور باستحسان ثم أغمض عينيه ونطق بكلمات شقت قلب أرسلان من الصدمة والمفاجأة.

// - أرسلان، يا بني إني أراك خير عريسٍ وزوجٍ لابنتي كاميليانا، أنتَ الوحيد الذي ربيته وأثق به جيداً.

// وقفت الكلمات عالقة في حلق أرسلان، كيف يكون زوجاً لفتاة أخرى غير كانتس، كيف يمكنه أن يرفض هذا العرض، من رجلٍ له السلطة على حياته، ويمسكه من رقبته، فلولا أن انتشله من أصقاع مدينة دايجورا بعد وفاة والدته، وبعد أن أعجب به وبذكائه، إن رفضه سيكون كفيلاً لإنهاء حياته إلى الأبد.

// ذهب ليلبي دعوة عشاءٍ أخرى متعب النفس والروح، كانت دعوة من خطيبته ووالدتها، ففي نهاية كل أسبوع اعتاد زيارتهم، لبث صامتاً شارداً وهو يستمع لكانتس تحكي له عن مقابلاتها الأخيرة وبحث تخرجها وهو يومئ بلا ردة فعل تذكر، ما دفع كانتس لتسأله عن حاله، فيجيب بأنه متعب قليلاً وأنه واجه يوماً عصيباً ، فراحت تطبطب عليه بكلماتها ووعدته أن تساعده وتسانده في مختبره، ارتسم طيف ابتسامة حزينة ممتنة على شفتيه .
// " على الأقل انا أعرف ومتأكد من هي فتاتي حقاً "

// يتبع!

// `
// },
// {
//     id: 24,
//     title: '2. Chapter 2',
//     content: ''
// },
// {
//     id: 25,
//     title: '3. Chapter 3',
//     content: ''

// }, {
//     id: 26,
//     title: '4. Chapter 4',
//     content: ''

// }, {
//     id: 27,
//     title: '5. Chapter 5',
//     content: ''

// },
// ];
interface IChaptersState {
    chapters: TChapters[];
    myBooks: [];
    loading: TLoading;
    error: string | null;
}

const initialState: IChaptersState = {
    chapters: [],
    myBooks: [],
    loading: "idle",
    error: null,
};
const chapters = createSlice({
    name: 'chapters',
    initialState,
    reducers: {
        actClearChapters: (state) => {
            state.chapters = []
        }
    },
    extraReducers: (builder) => {
        // get books
        builder.addCase(actGetChapters.pending, (state) => {
            state.loading = "pending";
            state.error = null;
        });
        builder.addCase(actGetChapters.fulfilled, (state, action) => {
            state.loading = "succeeded";
            state.chapters = action.payload;
        });
        builder.addCase(actGetChapters.rejected, (state, action) => {
            state.loading = "failed";
            if (isString(action.payload)) {
                state.error = action.payload;
            }
        });

        // add chapter 
        builder.addCase(actAddChapter.pending, (state) => {
            state.loading = "pending";
            state.error = null;
        });
        builder.addCase(actAddChapter.fulfilled, (state, action) => {
            state.loading = "succeeded";
            // state.chapters = action.payload;
        });
        builder.addCase(actAddChapter.rejected, (state, action) => {
            state.loading = "failed";
            if (isString(action.payload)) {
                state.error = action.payload;
            }
        });

        // Accept chapter 
        builder.addCase(actAcceptChapters.pending, (state) => {
            state.loading = "pending";
            state.error = null;
        });
        builder.addCase(actAcceptChapters.fulfilled, (state, action) => {
            state.loading = "succeeded";
            // state.chapters = action.payload;
        });
        builder.addCase(actAcceptChapters.rejected, (state, action) => {
            state.loading = "failed";
            if (isString(action.payload)) {
                state.error = action.payload;
            }
        });

        // Deny chapter 
        builder.addCase(actDenyChapters.pending, (state) => {
            state.loading = "pending";
            state.error = null;
        });
        builder.addCase(actDenyChapters.fulfilled, (state, action) => {
            state.loading = "succeeded";
            // state.chapters = action.payload;
        });
        builder.addCase(actDenyChapters.rejected, (state, action) => {
            state.loading = "failed";
            if (isString(action.payload)) {
                state.error = action.payload;
            }
        });
    }

})
export const { actClearChapters } = chapters.actions;
export default chapters.reducer